<a href="https://colab.research.google.com/github/DorotaJanosz/machine-learning-bootcamp/blob/master/supervised/01_basics/03_feature_extraction.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [0]:
import numpy as np
import pandas as pd
import sklearn

In [6]:
def fetch_financial_data(company='AMZN'):
    """
    This function fetches stock market quotations.
    """
    import pandas_datareader.data as web
    return web.DataReader(name=company, data_source='stooq')

df_raw = fetch_financial_data()
df = df_raw.copy()
df = df[:5]
df

                 Open      High      Low    Close   Volume
Date
2020-05-20  2477.8700  2500.010  2467.27  2497.94  3998143
2020-05-19  2429.8300  2484.995  2428.97  2449.33  4320498
2020-05-18  2404.3456  2433.000  2384.01  2426.26  4366572
2020-05-15  2368.5200  2411.000  2356.37  2409.78  4234951
2020-05-14  2361.0100  2391.370  2353.21  2388.85  3648128

In [7]:
df.info()

<class 'pandas.core.frame.DataFrame'>
DatetimeIndex: 5 entries, 2020-05-20 to 2020-05-14
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Open    5 non-null      float64
 1   High    5 non-null      float64
 2   Low     5 non-null      float64
 3   Close   5 non-null      float64
 4   Volume  5 non-null      int64
dtypes: float64(4), int64(1)
memory usage: 240.0 bytes

###Generowanie nowych zmiennych

In [9]:
df.index

DatetimeIndex(['2020-05-20', '2020-05-19', '2020-05-18', '2020-05-15',
               '2020-05-14'],
              dtype='datetime64[ns]', name='Date', freq=None)

In [10]:
df.index.day

Int64Index([20, 19, 18, 15, 14], dtype='int64', name='Date')

In [13]:
df['day'] = df.index.day
df['month'] = df.index.month
df['year'] = df.index.year
df

                 Open      High      Low    Close   Volume  day  month  year
Date
2020-05-20  2477.8700  2500.010  2467.27  2497.94  3998143   20      5  2020
2020-05-19  2429.8300  2484.995  2428.97  2449.33  4320498   19      5  2020
2020-05-18  2404.3456  2433.000  2384.01  2426.26  4366572   18      5  2020
2020-05-15  2368.5200  2411.000  2356.37  2409.78  4234951   15      5  2020
2020-05-14  2361.0100  2391.370  2353.21  2388.85  3648128   14      5  2020

###Dyskretyzacja zmiennej ciągłej

In [29]:
df = pd.DataFrame(data={'height': [175., 178.5, 185., 191., 184.5, 183., 168.]})
df

   height
0   175.0
1   178.5
2   185.0
3   191.0
4   184.5
5   183.0
6   168.0

In [30]:
df['height_cat'] = pd.cut(df.height, bins=3)
df

   height          height_cat
0   175.0  (167.977, 175.667]
1   178.5  (175.667, 183.333]
2   185.0    (183.333, 191.0]
3   191.0    (183.333, 191.0]
4   184.5    (183.333, 191.0]
5   183.0  (175.667, 183.333]
6   168.0  (167.977, 175.667]

In [31]:
df['height_cat'] = pd.cut(df.height, bins=(160, 175, 180, 195)) 
df

   height  height_cat
0   175.0  (160, 175]
1   178.5  (175, 180]
2   185.0  (180, 195]
3   191.0  (180, 195]
4   184.5  (180, 195]
5   183.0  (180, 195]
6   168.0  (160, 175]

In [32]:
df['height_cat'] = pd.cut(df.height, bins=(160, 175, 180, 195), labels=['small', 'medium', 'high'])
df

   height height_cat
0   175.0      small
1   178.5     medium
2   185.0       high
3   191.0       high
4   184.5       high
5   183.0       high
6   168.0      small

In [34]:
pd.get_dummies(df, drop_first=True, prefix='height')

   height  height_medium  height_high
0   175.0              0            0
1   178.5              1            0
2   185.0              0            1
3   191.0              0            1
4   184.5              0            1
5   183.0              0            1
6   168.0              0            0

###Ekstrakcja cech

In [35]:
df = pd.DataFrame(data={'lang': [['PL', 'ENG'], ['GER', 'ENG', 'PL', 'FRA'], ['RUS']]})
df

                  lang
0            [PL, ENG]
1  [GER, ENG, PL, FRA]
2                [RUS]

In [37]:
df['lang_number'] = df['lang'].apply(len)
df

                  lang  lang_number
0            [PL, ENG]            2
1  [GER, ENG, PL, FRA]            4
2                [RUS]            1

In [40]:
df['PL_flag'] = df['lang'].apply(lambda x: 1 if 'PL' in x else 0)
df

                  lang  lang_number  PL_flag
0            [PL, ENG]            2        1
1  [GER, ENG, PL, FRA]            4        1
2                [RUS]            1        0

In [41]:
df = pd.DataFrame(data={'website': ['wp.pl', 'onet.pl', 'google.com']})
df

      website
0       wp.pl
1     onet.pl
2  google.com

In [43]:
df.website.str.split('.', expand=True)

        0    1
0      wp   pl
1    onet   pl
2  google  com

In [45]:
new = df.website.str.split('.', expand=True)

df['portal'] = new[0]
df['extension'] = new[1]
df

      website  portal extension
0       wp.pl      wp        pl
1     onet.pl    onet        pl
2  google.com  google       com